<h1>
<font color="#9de482"> Desafios </font>
</h1>

In [23]:
import pandas as pd
import numpy as np
import json

Base do desafio: https://cdn3.gnarususercontent.com.br/2929-pandas/informacoes.json

```bash
! curl https://cdn3.gnarususercontent.com.br/2929-pandas/informacoes.json > ./data/informacoes.json
```

In [24]:
data_path: str = "./data/informacoes.json"

__Teoria__:  

O método `json_normalize()` é usado para normalizar dados JSON em um formato tabular (como um DataFrame do Pandas) para facilitar a análise e manipulação. Os parâmetros mais importantes do método json_normalize() são:

- data: o objeto JSON a ser normalizado.  
- record_path: um caminho para acessar o array de registros dentro do objeto JSON.  
- meta: uma lista de colunas adicionais a serem incluídas no DataFrame, além das colunas normalizadas.  
- errors: como lidar com erros de normalização. Os valores possíveis são "raise" (lançar um erro), "ignore" (ignorar o erro).  
- sep: separador de colunas usado para concatenar as chaves do objeto JSON aninhado. O padrão é ".".

In [25]:
df = pd.read_json(data_path)
df

   nome  idade                                          enderecos
0  João     28  {'tipo': 'casa', 'rua': 'Rua A', 'numero': 123...
1  João     28  {'tipo': 'trabalho', 'rua': 'Rua B', 'numero':...

In [26]:
with open(data_path) as file:
    raw_json = json.load(file)
raw_json

{'nome': 'João',
 'idade': 28,
 'enderecos': [{'tipo': 'casa',
   'rua': 'Rua A',
   'numero': 123,
   'cidade': 'São Paulo'},
  {'tipo': 'trabalho',
   'rua': 'Rua B',
   'numero': 456,
   'cidade': 'Rio de Janeiro'}]}

Trata-se de informações de endereço de João, dividindo-os em endereço do tipo trabalho e casa.

In [27]:
df = pd.json_normalize(
    data=raw_json, 
    meta=['nome','idade'],
    record_path='enderecos'
)
df

       tipo    rua  numero          cidade  nome idade
0      casa  Rua A     123       São Paulo  João    28
1  trabalho  Rua B     456  Rio de Janeiro  João    28

 <font color=#96d97c size=5>Desafio 2 </font>  
 
 https://cdn3.gnarususercontent.com.br/2929-pandas/dados.json

In [28]:
! curl https://cdn3.gnarususercontent.com.br/2929-pandas/dados.json > "./data/dados.json"

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed

  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
100   562  100   562    0     0   2222      0 --:--:-- --:--:-- --:--:--  2266

In [29]:
desafio2_path = "./data/dados.json"

In [ ]:
desafio2 = pd.read_json(desafio2_path, )
desafio2

                                             pessoas
0  {'nome': 'João', 'idade': '25', 'endereco': {'...
1  {'nome': 'Maria', 'idade': 30, 'endereco': {'r...

In [41]:
df_pessoas = pd.json_normalize(desafio2['pessoas'])
df_pessoas

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,João,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,São Paulo
1,Maria,30,[21 3333-3333],,456,Rio de Janeiro

In [ ]:
df_pessoas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   nome             2 non-null      object
 1   idade            2 non-null      object
 2   telefones        2 non-null      object
 3   endereco.rua     2 non-null      object
 4   endereco.numero  2 non-null      int64
 5   endereco.cidade  2 non-null      object
dtypes: int64(1), object(5)
memory usage: 228.0+ bytes

In [46]:
df_pessoas.query("`endereco.rua` !=''")

# `endereco.rua` na Quert indica uma coluna nomeado com '.'

,nome,idade,telefones,endereco.rua,endereco.numero,endereco.cidade
0,João,25,"[11 1111-1111, 11 2222-2222]",Rua A,123,São Paulo